# Update Homebrew
update

# Update already-installed formula
# upgrade

# Add Repository
tap homebrew/versions || true
#tap phinze/homebrew-cask || true
#tap homebrew/binary || true

#==================
# Packages
#==================
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'tmux'
brew 'vim'
brew 'git'
# https://github.com/defunkt/gist/
brew 'gist'
# https://github.com/simonwhitaker/gibo
brew 'gibo'
# https://github.com/github/hub
brew 'hub'
brew 'tig'
brew 'tree'
brew 'wget'
brew 'curl'
# https://github.com/stedolan/jq
brew 'jq'
brew 'scala'
brew 'gradle'
brew 'sbt'
brew 'atool'
brew 'z'
brew 'fontforge'
brew 'peco'

# powerline用フォントを作成する
tap 'sanemat/font'
brew '--powerline --vim-powerline ricty'
brew '--with-powerline ricty'

# hakugen
brew 'font-hackgen'
brew 'font-hackgen-nerd'

# for brew-cask
brew 'brew-cask'

#==================
# .dmg
#==================
cask 'alfred'
# cask 'dash'
# cask 'でインストールしたアプリも検索対象に
cask 'alfred link'
cask 'bettertouchtool'
# cask 'flux'
cask 'google-japanese-ime'
# cask ' intellij-idea-community
cask 'kindle'
cask 'iterm2'
cask 'quiver'
cask 'skitch'
cask 'sourcetree'
cask 'sequel-pro'
cask 'the-unarchiver'
# cask 'vivaldi'
cask 'visual-studio-code'
cask 'xtrafinder'

# Remove outdated versions
#cleanup
